zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/pio/pic32cz2038ca70064.h
/**
 * \brief Peripheral I/O description for PIC32CZ2038CA70064
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ2038CA70064_GPIO_H_
#define _PIC32CZ2038CA70064_GPIO_H_

/* ========== Peripheral I/O pin numbers ========== */
#define PIN_PA0                     (  0)  /**< Pin Number for PA0 */
#define PIN_PA1                     (  1)  /**< Pin Number for PA1 */
#define PIN_PA2                     (  2)  /**< Pin Number for PA2 */
#define PIN_PA3                     (  3)  /**< Pin Number for PA3 */
#define PIN_PA4                     (  4)  /**< Pin Number for PA4 */
#define PIN_PA5                     (  5)  /**< Pin Number for PA5 */
#define PIN_PA6                     (  6)  /**< Pin Number for PA6 */
#define PIN_PA7                     (  7)  /**< Pin Number for PA7 */
#define PIN_PA8                     (  8)  /**< Pin Number for PA8 */
#define PIN_PA9                     (  9)  /**< Pin Number for PA9 */
#define PIN_PA10                    ( 10)  /**< Pin Number for PA10 */
#define PIN_PA11                    ( 11)  /**< Pin Number for PA11 */
#define PIN_PA12                    ( 12)  /**< Pin Number for PA12 */
#define PIN_PA13                    ( 13)  /**< Pin Number for PA13 */
#define PIN_PA14                    ( 14)  /**< Pin Number for PA14 */
#define PIN_PA15                    ( 15)  /**< Pin Number for PA15 */
#define PIN_PA16                    ( 16)  /**< Pin Number for PA16 */
#define PIN_PA17                    ( 17)  /**< Pin Number for PA17 */
#define PIN_PA18                    ( 18)  /**< Pin Number for PA18 */
#define PIN_PA19                    ( 19)  /**< Pin Number for PA19 */
#define PIN_PA20                    ( 20)  /**< Pin Number for PA20 */
#define PIN_PA21                    ( 21)  /**< Pin Number for PA21 */
#define PIN_PA22                    ( 22)  /**< Pin Number for PA22 */
#define PIN_PA23                    ( 23)  /**< Pin Number for PA23 */
#define PIN_PA24                    ( 24)  /**< Pin Number for PA24 */
#define PIN_PA25                    ( 25)  /**< Pin Number for PA25 */
#define PIN_PA26                    ( 26)  /**< Pin Number for PA26 */
#define PIN_PA27                    ( 27)  /**< Pin Number for PA27 */
#define PIN_PA28                    ( 28)  /**< Pin Number for PA28 */
#define PIN_PA29                    ( 29)  /**< Pin Number for PA29 */
#define PIN_PA30                    ( 30)  /**< Pin Number for PA30 */
#define PIN_PA31                    ( 31)  /**< Pin Number for PA31 */
#define PIN_PB0                     ( 32)  /**< Pin Number for PB0 */
#define PIN_PB1                     ( 33)  /**< Pin Number for PB1 */
#define PIN_PB2                     ( 34)  /**< Pin Number for PB2 */
#define PIN_PB3                     ( 35)  /**< Pin Number for PB3 */
#define PIN_PB4                     ( 36)  /**< Pin Number for PB4 */
#define PIN_PB5                     ( 37)  /**< Pin Number for PB5 */
#define PIN_PB6                     ( 38)  /**< Pin Number for PB6 */
#define PIN_PB7                     ( 39)  /**< Pin Number for PB7 */
#define PIN_PB8                     ( 40)  /**< Pin Number for PB8 */
#define PIN_PB9                     ( 41)  /**< Pin Number for PB9 */
#define PIN_PB12                    ( 44)  /**< Pin Number for PB12 */
#define PIN_PB13                    ( 45)  /**< Pin Number for PB13 */
#define PIN_PD0                     ( 96)  /**< Pin Number for PD0 */
#define PIN_PD1                     ( 97)  /**< Pin Number for PD1 */
#define PIN_PD2                     ( 98)  /**< Pin Number for PD2 */
#define PIN_PD3                     ( 99)  /**< Pin Number for PD3 */
#define PIN_PD4                     (100)  /**< Pin Number for PD4 */
#define PIN_PD5                     (101)  /**< Pin Number for PD5 */
#define PIN_PD6                     (102)  /**< Pin Number for PD6 */
#define PIN_PD7                     (103)  /**< Pin Number for PD7 */
#define PIN_PD8                     (104)  /**< Pin Number for PD8 */
#define PIN_PD9                     (105)  /**< Pin Number for PD9 */
#define PIN_PD10                    (106)  /**< Pin Number for PD10 */
#define PIN_PD11                    (107)  /**< Pin Number for PD11 */
#define PIN_PD12                    (108)  /**< Pin Number for PD12 */
#define PIN_PD13                    (109)  /**< Pin Number for PD13 */
#define PIN_PD14                    (110)  /**< Pin Number for PD14 */
#define PIN_PD15                    (111)  /**< Pin Number for PD15 */
#define PIN_PD16                    (112)  /**< Pin Number for PD16 */
#define PIN_PD17                    (113)  /**< Pin Number for PD17 */
#define PIN_PD18                    (114)  /**< Pin Number for PD18 */
#define PIN_PD19                    (115)  /**< Pin Number for PD19 */
#define PIN_PD20                    (116)  /**< Pin Number for PD20 */
#define PIN_PD21                    (117)  /**< Pin Number for PD21 */
#define PIN_PD22                    (118)  /**< Pin Number for PD22 */
#define PIN_PD23                    (119)  /**< Pin Number for PD23 */
#define PIN_PD24                    (120)  /**< Pin Number for PD24 */
#define PIN_PD25                    (121)  /**< Pin Number for PD25 */
#define PIN_PD26                    (122)  /**< Pin Number for PD26 */
#define PIN_PD27                    (123)  /**< Pin Number for PD27 */
#define PIN_PD28                    (124)  /**< Pin Number for PD28 */
#define PIN_PD29                    (125)  /**< Pin Number for PD29 */
#define PIN_PD30                    (126)  /**< Pin Number for PD30 */
#define PIN_PD31                    (127)  /**< Pin Number for PD31 */

/* ========== Peripheral I/O masks ========== */
#define PORT_PA0                    (1U << 0)  /**< PORT Mask for PA0 */
#define PORT_PA1                    (1U << 1)  /**< PORT Mask for PA1 */
#define PORT_PA2                    (1U << 2)  /**< PORT Mask for PA2 */
#define PORT_PA3                    (1U << 3)  /**< PORT Mask for PA3 */
#define PORT_PA4                    (1U << 4)  /**< PORT Mask for PA4 */
#define PORT_PA5                    (1U << 5)  /**< PORT Mask for PA5 */
#define PORT_PA6                    (1U << 6)  /**< PORT Mask for PA6 */
#define PORT_PA7                    (1U << 7)  /**< PORT Mask for PA7 */
#define PORT_PA8                    (1U << 8)  /**< PORT Mask for PA8 */
#define PORT_PA9                    (1U << 9)  /**< PORT Mask for PA9 */
#define PORT_PA10                   (1U << 10) /**< PORT Mask for PA10 */
#define PORT_PA11                   (1U << 11) /**< PORT Mask for PA11 */
#define PORT_PA12                   (1U << 12) /**< PORT Mask for PA12 */
#define PORT_PA13                   (1U << 13) /**< PORT Mask for PA13 */
#define PORT_PA14                   (1U << 14) /**< PORT Mask for PA14 */
#define PORT_PA15                   (1U << 15) /**< PORT Mask for PA15 */
#define PORT_PA16                   (1U << 16) /**< PORT Mask for PA16 */
#define PORT_PA17                   (1U << 17) /**< PORT Mask for PA17 */
#define PORT_PA18                   (1U << 18) /**< PORT Mask for PA18 */
#define PORT_PA19                   (1U << 19) /**< PORT Mask for PA19 */
#define PORT_PA20                   (1U << 20) /**< PORT Mask for PA20 */
#define PORT_PA21                   (1U << 21) /**< PORT Mask for PA21 */
#define PORT_PA22                   (1U << 22) /**< PORT Mask for PA22 */
#define PORT_PA23                   (1U << 23) /**< PORT Mask for PA23 */
#define PORT_PA24                   (1U << 24) /**< PORT Mask for PA24 */
#define PORT_PA25                   (1U << 25) /**< PORT Mask for PA25 */
#define PORT_PA26                   (1U << 26) /**< PORT Mask for PA26 */
#define PORT_PA27                   (1U << 27) /**< PORT Mask for PA27 */
#define PORT_PA28                   (1U << 28) /**< PORT Mask for PA28 */
#define PORT_PA29                   (1U << 29) /**< PORT Mask for PA29 */
#define PORT_PA30                   (1U << 30) /**< PORT Mask for PA30 */
#define PORT_PA31                   (1U << 31) /**< PORT Mask for PA31 */
#define PORT_PB0                    (1U << 0)  /**< PORT Mask for PB0 */
#define PORT_PB1                    (1U << 1)  /**< PORT Mask for PB1 */
#define PORT_PB2                    (1U << 2)  /**< PORT Mask for PB2 */
#define PORT_PB3                    (1U << 3)  /**< PORT Mask for PB3 */
#define PORT_PB4                    (1U << 4)  /**< PORT Mask for PB4 */
#define PORT_PB5                    (1U << 5)  /**< PORT Mask for PB5 */
#define PORT_PB6                    (1U << 6)  /**< PORT Mask for PB6 */
#define PORT_PB7                    (1U << 7)  /**< PORT Mask for PB7 */
#define PORT_PB8                    (1U << 8)  /**< PORT Mask for PB8 */
#define PORT_PB9                    (1U << 9)  /**< PORT Mask for PB9 */
#define PORT_PB12                   (1U << 12) /**< PORT Mask for PB12 */
#define PORT_PB13                   (1U << 13) /**< PORT Mask for PB13 */
#define PORT_PD0                    (1U << 0)  /**< PORT Mask for PD0 */
#define PORT_PD1                    (1U << 1)  /**< PORT Mask for PD1 */
#define PORT_PD2                    (1U << 2)  /**< PORT Mask for PD2 */
#define PORT_PD3                    (1U << 3)  /**< PORT Mask for PD3 */
#define PORT_PD4                    (1U << 4)  /**< PORT Mask for PD4 */
#define PORT_PD5                    (1U << 5)  /**< PORT Mask for PD5 */
#define PORT_PD6                    (1U << 6)  /**< PORT Mask for PD6 */
#define PORT_PD7                    (1U << 7)  /**< PORT Mask for PD7 */
#define PORT_PD8                    (1U << 8)  /**< PORT Mask for PD8 */
#define PORT_PD9                    (1U << 9)  /**< PORT Mask for PD9 */
#define PORT_PD10                   (1U << 10) /**< PORT Mask for PD10 */
#define PORT_PD11                   (1U << 11) /**< PORT Mask for PD11 */
#define PORT_PD12                   (1U << 12) /**< PORT Mask for PD12 */
#define PORT_PD13                   (1U << 13) /**< PORT Mask for PD13 */
#define PORT_PD14                   (1U << 14) /**< PORT Mask for PD14 */
#define PORT_PD15                   (1U << 15) /**< PORT Mask for PD15 */
#define PORT_PD16                   (1U << 16) /**< PORT Mask for PD16 */
#define PORT_PD17                   (1U << 17) /**< PORT Mask for PD17 */
#define PORT_PD18                   (1U << 18) /**< PORT Mask for PD18 */
#define PORT_PD19                   (1U << 19) /**< PORT Mask for PD19 */
#define PORT_PD20                   (1U << 20) /**< PORT Mask for PD20 */
#define PORT_PD21                   (1U << 21) /**< PORT Mask for PD21 */
#define PORT_PD22                   (1U << 22) /**< PORT Mask for PD22 */
#define PORT_PD23                   (1U << 23) /**< PORT Mask for PD23 */
#define PORT_PD24                   (1U << 24) /**< PORT Mask for PD24 */
#define PORT_PD25                   (1U << 25) /**< PORT Mask for PD25 */
#define PORT_PD26                   (1U << 26) /**< PORT Mask for PD26 */
#define PORT_PD27                   (1U << 27) /**< PORT Mask for PD27 */
#define PORT_PD28                   (1U << 28) /**< PORT Mask for PD28 */
#define PORT_PD29                   (1U << 29) /**< PORT Mask for PD29 */
#define PORT_PD30                   (1U << 30) /**< PORT Mask for PD30 */
#define PORT_PD31                   (1U << 31) /**< PORT Mask for PD31 */

