zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/pio/pic32cz2038ca70064.h
#define PORT_PA2A_PWMC0_PWMH1                      (1UL << 2)
#define PIN_PA12B_PWMC0_PWMH1                      (12L)        /**< PWMC0 signal: PWMC0_PWMH1 on PA12 mux B*/
#define MUX_PA12B_PWMC0_PWMH1                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH1 */
#define PORT_PA12B_PWMC0_PWMH1                     (1UL << 12)
#define PIN_PA24B_PWMC0_PWMH1                      (24L)        /**< PWMC0 signal: PWMC0_PWMH1 on PA24 mux B*/
#define MUX_PA24B_PWMC0_PWMH1                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH1 */
#define PORT_PA24B_PWMC0_PWMH1                     (1UL << 24)
#define PIN_PB1A_PWMC0_PWMH1                       (33L)        /**< PWMC0 signal: PWMC0_PWMH1 on PB1 mux A*/
#define MUX_PB1A_PWMC0_PWMH1                       (0L)         /**< PWMC0 signal line function value: PWMC0_PWMH1 */
#define PORT_PB1A_PWMC0_PWMH1                      (1UL << 1)
#define PIN_PD21A_PWMC0_PWMH1                      (117L)       /**< PWMC0 signal: PWMC0_PWMH1 on PD21 mux A*/
#define MUX_PD21A_PWMC0_PWMH1                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWMH1 */
#define PORT_PD21A_PWMC0_PWMH1                     (1UL << 21)
#define PIN_PA13B_PWMC0_PWMH2                      (13L)        /**< PWMC0 signal: PWMC0_PWMH2 on PA13 mux B*/
#define MUX_PA13B_PWMC0_PWMH2                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH2 */
#define PORT_PA13B_PWMC0_PWMH2                     (1UL << 13)
#define PIN_PA25B_PWMC0_PWMH2                      (25L)        /**< PWMC0 signal: PWMC0_PWMH2 on PA25 mux B*/
#define MUX_PA25B_PWMC0_PWMH2                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH2 */
#define PORT_PA25B_PWMC0_PWMH2                     (1UL << 25)
#define PIN_PB4B_PWMC0_PWMH2                       (36L)        /**< PWMC0 signal: PWMC0_PWMH2 on PB4 mux B*/
#define MUX_PB4B_PWMC0_PWMH2                       (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH2 */
#define PORT_PB4B_PWMC0_PWMH2                      (1UL << 4)
#define PIN_PD22A_PWMC0_PWMH2                      (118L)       /**< PWMC0 signal: PWMC0_PWMH2 on PD22 mux A*/
#define MUX_PD22A_PWMC0_PWMH2                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWMH2 */
#define PORT_PD22A_PWMC0_PWMH2                     (1UL << 22)
#define PIN_PA7B_PWMC0_PWMH3                       (7L)         /**< PWMC0 signal: PWMC0_PWMH3 on PA7 mux B*/
#define MUX_PA7B_PWMC0_PWMH3                       (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH3 */
#define PORT_PA7B_PWMC0_PWMH3                      (1UL << 7)
#define PIN_PA14B_PWMC0_PWMH3                      (14L)        /**< PWMC0 signal: PWMC0_PWMH3 on PA14 mux B*/
#define MUX_PA14B_PWMC0_PWMH3                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH3 */
#define PORT_PA14B_PWMC0_PWMH3                     (1UL << 14)
#define PIN_PA17C_PWMC0_PWMH3                      (17L)        /**< PWMC0 signal: PWMC0_PWMH3 on PA17 mux C*/
#define MUX_PA17C_PWMC0_PWMH3                      (2L)         /**< PWMC0 signal line function value: PWMC0_PWMH3 */
#define PORT_PA17C_PWMC0_PWMH3                     (1UL << 17)
#define PIN_PD23A_PWMC0_PWMH3                      (119L)       /**< PWMC0 signal: PWMC0_PWMH3 on PD23 mux A*/
#define MUX_PD23A_PWMC0_PWMH3                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWMH3 */
#define PORT_PD23A_PWMC0_PWMH3                     (1UL << 23)
#define PIN_PA1A_PWMC0_PWML0                       (1L)         /**< PWMC0 signal: PWMC0_PWML0 on PA1 mux A*/
#define MUX_PA1A_PWMC0_PWML0                       (0L)         /**< PWMC0 signal line function value: PWMC0_PWML0 */
#define PORT_PA1A_PWMC0_PWML0                      (1UL << 1)
#define PIN_PA19B_PWMC0_PWML0                      (19L)        /**< PWMC0 signal: PWMC0_PWML0 on PA19 mux B*/
#define MUX_PA19B_PWMC0_PWML0                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWML0 */
#define PORT_PA19B_PWMC0_PWML0                     (1UL << 19)
#define PIN_PB5B_PWMC0_PWML0                       (37L)        /**< PWMC0 signal: PWMC0_PWML0 on PB5 mux B*/
#define MUX_PB5B_PWMC0_PWML0                       (1L)         /**< PWMC0 signal line function value: PWMC0_PWML0 */
#define PORT_PB5B_PWMC0_PWML0                      (1UL << 5)
#define PIN_PD10B_PWMC0_PWML0                      (106L)       /**< PWMC0 signal: PWMC0_PWML0 on PD10 mux B*/
#define MUX_PD10B_PWMC0_PWML0                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWML0 */
#define PORT_PD10B_PWMC0_PWML0                     (1UL << 10)
#define PIN_PD24A_PWMC0_PWML0                      (120L)       /**< PWMC0 signal: PWMC0_PWML0 on PD24 mux A*/
#define MUX_PD24A_PWMC0_PWML0                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWML0 */
#define PORT_PD24A_PWMC0_PWML0                     (1UL << 24)
#define PIN_PA20B_PWMC0_PWML1                      (20L)        /**< PWMC0 signal: PWMC0_PWML1 on PA20 mux B*/
#define MUX_PA20B_PWMC0_PWML1                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWML1 */
#define PORT_PA20B_PWMC0_PWML1                     (1UL << 20)
#define PIN_PB12A_PWMC0_PWML1                      (44L)        /**< PWMC0 signal: PWMC0_PWML1 on PB12 mux A*/
#define MUX_PB12A_PWMC0_PWML1                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWML1 */
#define PORT_PB12A_PWMC0_PWML1                     (1UL << 12)
#define PIN_PD25A_PWMC0_PWML1                      (121L)       /**< PWMC0 signal: PWMC0_PWML1 on PD25 mux A*/
#define MUX_PD25A_PWMC0_PWML1                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWML1 */
#define PORT_PD25A_PWMC0_PWML1                     (1UL << 25)
#define PIN_PA16C_PWMC0_PWML2                      (16L)        /**< PWMC0 signal: PWMC0_PWML2 on PA16 mux C*/
#define MUX_PA16C_PWMC0_PWML2                      (2L)         /**< PWMC0 signal line function value: PWMC0_PWML2 */
#define PORT_PA16C_PWMC0_PWML2                     (1UL << 16)
#define PIN_PA30A_PWMC0_PWML2                      (30L)        /**< PWMC0 signal: PWMC0_PWML2 on PA30 mux A*/
#define MUX_PA30A_PWMC0_PWML2                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWML2 */
#define PORT_PA30A_PWMC0_PWML2                     (1UL << 30)
#define PIN_PB13A_PWMC0_PWML2                      (45L)        /**< PWMC0 signal: PWMC0_PWML2 on PB13 mux A*/
#define MUX_PB13A_PWMC0_PWML2                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWML2 */
#define PORT_PB13A_PWMC0_PWML2                     (1UL << 13)
#define PIN_PD26A_PWMC0_PWML2                      (122L)       /**< PWMC0 signal: PWMC0_PWML2 on PD26 mux A*/
#define MUX_PD26A_PWMC0_PWML2                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWML2 */
#define PORT_PD26A_PWMC0_PWML2                     (1UL << 26)
#define PIN_PA15C_PWMC0_PWML3                      (15L)        /**< PWMC0 signal: PWMC0_PWML3 on PA15 mux C*/
#define MUX_PA15C_PWMC0_PWML3                      (2L)         /**< PWMC0 signal line function value: PWMC0_PWML3 */
#define PORT_PA15C_PWMC0_PWML3                     (1UL << 15)
#define PIN_PD27A_PWMC0_PWML3                      (123L)       /**< PWMC0 signal: PWMC0_PWML3 on PD27 mux A*/
#define MUX_PD27A_PWMC0_PWML3                      (0L)         /**< PWMC0 signal line function value: PWMC0_PWML3 */
#define PORT_PD27A_PWMC0_PWML3                     (1UL << 27)
/* ========== PIO definition for PWMC1 peripheral ========== */
#define PIN_PA30B_PWMC1_PWMEXTRG0                  (30L)        /**< PWMC1 signal: PWMC1_PWMEXTRG0 on PA30 mux B*/
#define MUX_PA30B_PWMC1_PWMEXTRG0                  (1L)         /**< PWMC1 signal line function value: PWMC1_PWMEXTRG0 */
#define PORT_PA30B_PWMC1_PWMEXTRG0                 (1UL << 30)
#define PIN_PA18A_PWMC1_PWMEXTRG1                  (18L)        /**< PWMC1 signal: PWMC1_PWMEXTRG1 on PA18 mux A*/
#define MUX_PA18A_PWMC1_PWMEXTRG1                  (0L)         /**< PWMC1 signal line function value: PWMC1_PWMEXTRG1 */
#define PORT_PA18A_PWMC1_PWMEXTRG1                 (1UL << 18)
#define PIN_PA21C_PWMC1_PWMFI0                     (21L)        /**< PWMC1 signal: PWMC1_PWMFI0 on PA21 mux C*/
#define MUX_PA21C_PWMC1_PWMFI0                     (2L)         /**< PWMC1 signal line function value: PWMC1_PWMFI0 */
#define PORT_PA21C_PWMC1_PWMFI0                    (1UL << 21)
#define PIN_PA26D_PWMC1_PWMFI1                     (26L)        /**< PWMC1 signal: PWMC1_PWMFI1 on PA26 mux D*/
#define MUX_PA26D_PWMC1_PWMFI1                     (3L)         /**< PWMC1 signal line function value: PWMC1_PWMFI1 */
#define PORT_PA26D_PWMC1_PWMFI1                    (1UL << 26)
#define PIN_PA28D_PWMC1_PWMFI2                     (28L)        /**< PWMC1 signal: PWMC1_PWMFI2 on PA28 mux D*/
#define MUX_PA28D_PWMC1_PWMFI2                     (3L)         /**< PWMC1 signal line function value: PWMC1_PWMFI2 */
#define PORT_PA28D_PWMC1_PWMFI2                    (1UL << 28)
#define PIN_PA12C_PWMC1_PWMH0                      (12L)        /**< PWMC1 signal: PWMC1_PWMH0 on PA12 mux C*/
#define MUX_PA12C_PWMC1_PWMH0                      (2L)         /**< PWMC1 signal line function value: PWMC1_PWMH0 */
#define PORT_PA12C_PWMC1_PWMH0                     (1UL << 12)
#define PIN_PD1B_PWMC1_PWMH0                       (97L)        /**< PWMC1 signal: PWMC1_PWMH0 on PD1 mux B*/
#define MUX_PD1B_PWMC1_PWMH0                       (1L)         /**< PWMC1 signal line function value: PWMC1_PWMH0 */
#define PORT_PD1B_PWMC1_PWMH0                      (1UL << 1)
#define PIN_PA14C_PWMC1_PWMH1                      (14L)        /**< PWMC1 signal: PWMC1_PWMH1 on PA14 mux C*/
#define MUX_PA14C_PWMC1_PWMH1                      (2L)         /**< PWMC1 signal line function value: PWMC1_PWMH1 */
#define PORT_PA14C_PWMC1_PWMH1                     (1UL << 14)
#define PIN_PD3B_PWMC1_PWMH1                       (99L)        /**< PWMC1 signal: PWMC1_PWMH1 on PD3 mux B*/
#define MUX_PD3B_PWMC1_PWMH1                       (1L)         /**< PWMC1 signal line function value: PWMC1_PWMH1 */
#define PORT_PD3B_PWMC1_PWMH1                      (1UL << 3)
#define PIN_PA31D_PWMC1_PWMH2                      (31L)        /**< PWMC1 signal: PWMC1_PWMH2 on PA31 mux D*/
#define MUX_PA31D_PWMC1_PWMH2                      (3L)         /**< PWMC1 signal line function value: PWMC1_PWMH2 */
#define PORT_PA31D_PWMC1_PWMH2                     (1UL << 31)
#define PIN_PD5B_PWMC1_PWMH2                       (101L)       /**< PWMC1 signal: PWMC1_PWMH2 on PD5 mux B*/
#define MUX_PD5B_PWMC1_PWMH2                       (1L)         /**< PWMC1 signal line function value: PWMC1_PWMH2 */
#define PORT_PD5B_PWMC1_PWMH2                      (1UL << 5)
#define PIN_PA8A_PWMC1_PWMH3                       (8L)         /**< PWMC1 signal: PWMC1_PWMH3 on PA8 mux A*/
#define MUX_PA8A_PWMC1_PWMH3                       (0L)         /**< PWMC1 signal line function value: PWMC1_PWMH3 */
#define PORT_PA8A_PWMC1_PWMH3                      (1UL << 8)
#define PIN_PD7B_PWMC1_PWMH3                       (103L)       /**< PWMC1 signal: PWMC1_PWMH3 on PD7 mux B*/
#define MUX_PD7B_PWMC1_PWMH3                       (1L)         /**< PWMC1 signal line function value: PWMC1_PWMH3 */
#define PORT_PD7B_PWMC1_PWMH3                      (1UL << 7)
#define PIN_PA11C_PWMC1_PWML0                      (11L)        /**< PWMC1 signal: PWMC1_PWML0 on PA11 mux C*/
#define MUX_PA11C_PWMC1_PWML0                      (2L)         /**< PWMC1 signal line function value: PWMC1_PWML0 */
#define PORT_PA11C_PWMC1_PWML0                     (1UL << 11)
#define PIN_PD0B_PWMC1_PWML0                       (96L)        /**< PWMC1 signal: PWMC1_PWML0 on PD0 mux B*/
#define MUX_PD0B_PWMC1_PWML0                       (1L)         /**< PWMC1 signal line function value: PWMC1_PWML0 */
#define PORT_PD0B_PWMC1_PWML0                      (1UL << 0)
#define PIN_PA13C_PWMC1_PWML1                      (13L)        /**< PWMC1 signal: PWMC1_PWML1 on PA13 mux C*/
#define MUX_PA13C_PWMC1_PWML1                      (2L)         /**< PWMC1 signal line function value: PWMC1_PWML1 */
#define PORT_PA13C_PWMC1_PWML1                     (1UL << 13)
#define PIN_PD2B_PWMC1_PWML1                       (98L)        /**< PWMC1 signal: PWMC1_PWML1 on PD2 mux B*/
#define MUX_PD2B_PWMC1_PWML1                       (1L)         /**< PWMC1 signal line function value: PWMC1_PWML1 */
#define PORT_PD2B_PWMC1_PWML1                      (1UL << 2)
#define PIN_PA23D_PWMC1_PWML2                      (23L)        /**< PWMC1 signal: PWMC1_PWML2 on PA23 mux D*/
#define MUX_PA23D_PWMC1_PWML2                      (3L)         /**< PWMC1 signal line function value: PWMC1_PWML2 */
#define PORT_PA23D_PWMC1_PWML2                     (1UL << 23)
#define PIN_PD4B_PWMC1_PWML2                       (100L)       /**< PWMC1 signal: PWMC1_PWML2 on PD4 mux B*/
#define MUX_PD4B_PWMC1_PWML2                       (1L)         /**< PWMC1 signal line function value: PWMC1_PWML2 */
#define PORT_PD4B_PWMC1_PWML2                      (1UL << 4)
#define PIN_PA5A_PWMC1_PWML3                       (5L)         /**< PWMC1 signal: PWMC1_PWML3 on PA5 mux A*/
#define MUX_PA5A_PWMC1_PWML3                       (0L)         /**< PWMC1 signal line function value: PWMC1_PWML3 */
#define PORT_PA5A_PWMC1_PWML3                      (1UL << 5)
#define PIN_PD6B_PWMC1_PWML3                       (102L)       /**< PWMC1 signal: PWMC1_PWML3 on PD6 mux B*/
#define MUX_PD6B_PWMC1_PWML3                       (1L)         /**< PWMC1 signal line function value: PWMC1_PWML3 */
#define PORT_PD6B_PWMC1_PWML3                      (1UL << 6)
/* ========== PIO definition for QSPI peripheral ========== */
#define PIN_PA11A_QSPI_QCS                         (11L)        /**< QSPI signal: QCS on PA11 mux A*/
#define MUX_PA11A_QSPI_QCS                         (0L)         /**< QSPI signal line function value: QCS */
#define PORT_PA11A_QSPI_QCS                        (1UL << 11)
#define PIN_PA13A_QSPI_QIO0                        (13L)        /**< QSPI signal: QIO0 on PA13 mux A*/
#define MUX_PA13A_QSPI_QIO0                        (0L)         /**< QSPI signal line function value: QIO0 */
#define PORT_PA13A_QSPI_QIO0                       (1UL << 13)
#define PIN_PA12A_QSPI_QIO1                        (12L)        /**< QSPI signal: QIO1 on PA12 mux A*/
#define MUX_PA12A_QSPI_QIO1                        (0L)         /**< QSPI signal line function value: QIO1 */
#define PORT_PA12A_QSPI_QIO1                       (1UL << 12)
#define PIN_PA17A_QSPI_QIO2                        (17L)        /**< QSPI signal: QIO2 on PA17 mux A*/
#define MUX_PA17A_QSPI_QIO2                        (0L)         /**< QSPI signal line function value: QIO2 */
#define PORT_PA17A_QSPI_QIO2                       (1UL << 17)
#define PIN_PD31A_QSPI_QIO3                        (127L)       /**< QSPI signal: QIO3 on PD31 mux A*/
#define MUX_PD31A_QSPI_QIO3                        (0L)         /**< QSPI signal line function value: QIO3 */
#define PORT_PD31A_QSPI_QIO3                       (1UL << 31)
#define PIN_PA14A_QSPI_QSCK                        (14L)        /**< QSPI signal: QSCK on PA14 mux A*/
#define MUX_PA14A_QSPI_QSCK                        (0L)         /**< QSPI signal line function value: QSCK */
#define PORT_PA14A_QSPI_QSCK                       (1UL << 14)
/* ========== PIO definition for RTC peripheral ========== */
#define PIN_PB0X1_RTC_RTCOUT0                      (32L)        /**< RTC signal: RTCOUT0 on PB0 mux X1*/
#define PORT_PB0X1_RTC_RTCOUT0                     (1UL << 0)
#define PIN_PB1X1_RTC_RTCOUT1                      (33L)        /**< RTC signal: RTCOUT1 on PB1 mux X1*/
#define PORT_PB1X1_RTC_RTCOUT1                     (1UL << 1)
/* ========== PIO definition for SSC peripheral ========== */
#define PIN_PA10C_SSC_RD                           (10L)        /**< SSC signal: RD on PA10 mux C*/
#define MUX_PA10C_SSC_RD                           (2L)         /**< SSC signal line function value: RD */
#define PORT_PA10C_SSC_RD                          (1UL << 10)
#define PIN_PD24B_SSC_RF                           (120L)       /**< SSC signal: RF on PD24 mux B*/
#define MUX_PD24B_SSC_RF                           (1L)         /**< SSC signal line function value: RF */
#define PORT_PD24B_SSC_RF                          (1UL << 24)
#define PIN_PA22A_SSC_RK                           (22L)        /**< SSC signal: RK on PA22 mux A*/
#define MUX_PA22A_SSC_RK                           (0L)         /**< SSC signal line function value: RK */
#define PORT_PA22A_SSC_RK                          (1UL << 22)
#define PIN_PB5D_SSC_TD                            (37L)        /**< SSC signal: TD on PB5 mux D*/
#define MUX_PB5D_SSC_TD                            (3L)         /**< SSC signal line function value: TD */
#define PORT_PB5D_SSC_TD                           (1UL << 5)
#define PIN_PD10C_SSC_TD                           (106L)       /**< SSC signal: TD on PD10 mux C*/
#define MUX_PD10C_SSC_TD                           (2L)         /**< SSC signal line function value: TD */
#define PORT_PD10C_SSC_TD                          (1UL << 10)
#define PIN_PD26B_SSC_TD                           (122L)       /**< SSC signal: TD on PD26 mux B*/
#define MUX_PD26B_SSC_TD                           (1L)         /**< SSC signal line function value: TD */
#define PORT_PD26B_SSC_TD                          (1UL << 26)
#define PIN_PB0D_SSC_TF                            (32L)        /**< SSC signal: TF on PB0 mux D*/
#define MUX_PB0D_SSC_TF                            (3L)         /**< SSC signal line function value: TF */
#define PORT_PB0D_SSC_TF                           (1UL << 0)
#define PIN_PB1D_SSC_TK                            (33L)        /**< SSC signal: TK on PB1 mux D*/
#define MUX_PB1D_SSC_TK                            (3L)         /**< SSC signal line function value: TK */
#define PORT_PB1D_SSC_TK                           (1UL << 1)
/* ========== PIO definition for TC0 peripheral ========== */
#define PIN_PA4B_TC0_TCLK0                         (4L)         /**< TC0 signal: TCLK0 on PA4 mux B*/
#define MUX_PA4B_TC0_TCLK0                         (1L)         /**< TC0 signal line function value: TCLK0 */
#define PORT_PA4B_TC0_TCLK0                        (1UL << 4)
#define PIN_PA28B_TC0_TCLK1                        (28L)        /**< TC0 signal: TCLK1 on PA28 mux B*/
#define MUX_PA28B_TC0_TCLK1                        (1L)         /**< TC0 signal line function value: TCLK1 */
#define PORT_PA28B_TC0_TCLK1                       (1UL << 28)
#define PIN_PA29B_TC0_TCLK2                        (29L)        /**< TC0 signal: TCLK2 on PA29 mux B*/
#define MUX_PA29B_TC0_TCLK2                        (1L)         /**< TC0 signal line function value: TCLK2 */
#define PORT_PA29B_TC0_TCLK2                       (1UL << 29)
#define PIN_PA0B_TC0_TIOA0                         (0L)         /**< TC0 signal: TIOA0 on PA0 mux B*/
#define MUX_PA0B_TC0_TIOA0                         (1L)         /**< TC0 signal line function value: TIOA0 */
#define PORT_PA0B_TC0_TIOA0                        (1UL << 0)
#define PIN_PA15B_TC0_TIOA1                        (15L)        /**< TC0 signal: TIOA1 on PA15 mux B*/
#define MUX_PA15B_TC0_TIOA1                        (1L)         /**< TC0 signal line function value: TIOA1 */
#define PORT_PA15B_TC0_TIOA1                       (1UL << 15)
#define PIN_PA26B_TC0_TIOA2                        (26L)        /**< TC0 signal: TIOA2 on PA26 mux B*/
#define MUX_PA26B_TC0_TIOA2                        (1L)         /**< TC0 signal line function value: TIOA2 */
#define PORT_PA26B_TC0_TIOA2                       (1UL << 26)
#define PIN_PA1B_TC0_TIOB0                         (1L)         /**< TC0 signal: TIOB0 on PA1 mux B*/
#define MUX_PA1B_TC0_TIOB0                         (1L)         /**< TC0 signal line function value: TIOB0 */
#define PORT_PA1B_TC0_TIOB0                        (1UL << 1)
#define PIN_PA16B_TC0_TIOB1                        (16L)        /**< TC0 signal: TIOB1 on PA16 mux B*/
#define MUX_PA16B_TC0_TIOB1                        (1L)         /**< TC0 signal line function value: TIOB1 */
#define PORT_PA16B_TC0_TIOB1                       (1UL << 16)
#define PIN_PA27B_TC0_TIOB2                        (27L)        /**< TC0 signal: TIOB2 on PA27 mux B*/
#define MUX_PA27B_TC0_TIOB2                        (1L)         /**< TC0 signal line function value: TIOB2 */
#define PORT_PA27B_TC0_TIOB2                       (1UL << 27)
/* ========== PIO definition for TC3 peripheral ========== */
#define PIN_PD24C_TC3_TCLK11                       (120L)       /**< TC3 signal: TCLK11 on PD24 mux C*/
#define MUX_PD24C_TC3_TCLK11                       (2L)         /**< TC3 signal line function value: TCLK11 */
#define PORT_PD24C_TC3_TCLK11                      (1UL << 24)
#define PIN_PD21C_TC3_TIOA11                       (117L)       /**< TC3 signal: TIOA11 on PD21 mux C*/
#define MUX_PD21C_TC3_TIOA11                       (2L)         /**< TC3 signal line function value: TIOA11 */
#define PORT_PD21C_TC3_TIOA11                      (1UL << 21)
#define PIN_PD22C_TC3_TIOB11                       (118L)       /**< TC3 signal: TIOB11 on PD22 mux C*/
#define MUX_PD22C_TC3_TIOB11                       (2L)         /**< TC3 signal line function value: TIOB11 */
#define PORT_PD22C_TC3_TIOB11                      (1UL << 22)
/* ========== PIO definition for TWI0 peripheral ========== */
#define PIN_PA4A_TWI0_TWCK0                        (4L)         /**< TWI0 signal: TWCK0 on PA4 mux A*/
#define MUX_PA4A_TWI0_TWCK0                        (0L)         /**< TWI0 signal line function value: TWCK0 */
#define PORT_PA4A_TWI0_TWCK0                       (1UL << 4)
#define PIN_PA3A_TWI0_TWD0                         (3L)         /**< TWI0 signal: TWD0 on PA3 mux A*/
#define MUX_PA3A_TWI0_TWD0                         (0L)         /**< TWI0 signal line function value: TWD0 */
#define PORT_PA3A_TWI0_TWD0                        (1UL << 3)
/* ========== PIO definition for TWI1 peripheral ========== */
#define PIN_PB5A_TWI1_TWCK1                        (37L)        /**< TWI1 signal: TWCK1 on PB5 mux A*/
#define MUX_PB5A_TWI1_TWCK1                        (0L)         /**< TWI1 signal line function value: TWCK1 */
#define PORT_PB5A_TWI1_TWCK1                       (1UL << 5)
#define PIN_PB4A_TWI1_TWD1                         (36L)        /**< TWI1 signal: TWD1 on PB4 mux A*/
#define MUX_PB4A_TWI1_TWD1                         (0L)         /**< TWI1 signal line function value: TWD1 */
#define PORT_PB4A_TWI1_TWD1                        (1UL << 4)
/* ========== PIO definition for UART0 peripheral ========== */
#define PIN_PA9A_UART0_URXD0                       (9L)         /**< UART0 signal: URXD0 on PA9 mux A*/
#define MUX_PA9A_UART0_URXD0                       (0L)         /**< UART0 signal line function value: URXD0 */
#define PORT_PA9A_UART0_URXD0                      (1UL << 9)
#define PIN_PA10A_UART0_UTXD0                      (10L)        /**< UART0 signal: UTXD0 on PA10 mux A*/
#define MUX_PA10A_UART0_UTXD0                      (0L)         /**< UART0 signal line function value: UTXD0 */
#define PORT_PA10A_UART0_UTXD0                     (1UL << 10)
/* ========== PIO definition for UART1 peripheral ========== */
#define PIN_PA5C_UART1_URXD1                       (5L)         /**< UART1 signal: URXD1 on PA5 mux C*/
#define MUX_PA5C_UART1_URXD1                       (2L)         /**< UART1 signal line function value: URXD1 */
